# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
# answer
ip = (input('Введите IP адрес сети в формате IP/mask: '))  # <class 'str'>
ip = ip.split('/')  # делим строку на список строк по символу '/'
mask = ip.pop(-1)  # берем последний элемент из списка строк
ip = ip[0]  # берем первый элемент из списка строк # <class 'str'>

# выводим IP
ip = ip.split('.')  # <class 'str'> делим строку на список строк по символу '.'
a = int(ip[0])  # <class 'str'> 1 строку в списке в int
b = int(ip[1])
c = int(ip[2])
d = int(ip[3])
out = '''
Network:
{:<10}{:<10}{:<10}{:<10}
{:08b}  {:08b}  {:08b}  {:08b}
'''
print(out.format(ip[0], ip[1], ip[2], ip[3], a, b, b, d))

# выводим mask
mask1 = '1' * int(mask) + '0' * (32 - int(mask))
a1 = mask1[0:8]
b1 = mask1[8:16]
c1 = mask1[16:24]
d1 = mask1[24:]
out1 = '''
Mask:
/{}
{:<10}{:<10}{:<10}{:<10}
{:8}  {:8}  {:8}  {:8}
'''
print(out1.format(mask, int(a1, 2), int(b1, 2), int(c1, 2), int(d1, 2), a1, b1, c1, d1))
